{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "4378fdbf",
   "metadata": {
    "vscode": {
     "languageId": "plaintext"
    }
   },
   "outputs": [],
   "source": [
    "%load_ext autoreload\n",
    "%autoreload 2\n",
    "    \n",
    "import sys\n",
    "import os\n",
    "\n",
    "# Aggiunge la cartella 'src' relativa alla posizione dello script\n",
    "sys.path.append(os.path.abspath(\"src\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "28c14df1-d6fb-4eb8-b7c8-996a1fb43868",
   "metadata": {},
   "source": [
    "## Import ISO14224 to NEO4J"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "8ec4e5f3",
   "metadata": {
    "vscode": {
     "languageId": "plaintext"
    }
   },
   "outputs": [],
   "source": [
    "from iso2neo4j import PlantDataImporter\n",
    "graph_importer = PlantDataImporter(\"neo4j://neo4j\",\"neo4j\",\"password\")\n",
    "graph_importer.clean_all_data()\n",
    "graph_importer.import_plant_data(\"../data/acme-plant.json\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3aed383d-253f-47d3-9ad2-bb3013962601",
   "metadata": {},
   "source": [
    "## Import data to InfluxDB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "4cdeffde-f637-4614-a2ac-ed6d20a92b9b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# get list of all equipments\n",
    "equipments = graph_importer.get_equipments()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "9c448579-8240-4fb7-b3f8-d8145987b719",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>EQUIPMENT</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ACME Limited.ACME Plant.PUMP-001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ACME Limited.ACME Plant.PUMP-002</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ACME Limited.ACME Plant.WIND-TURB-01</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                              EQUIPMENT\n",
       "0      ACME Limited.ACME Plant.PUMP-001\n",
       "1      ACME Limited.ACME Plant.PUMP-002\n",
       "2  ACME Limited.ACME Plant.WIND-TURB-01"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "equipments "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "8d752650-98f8-4624-916e-c97ad6fd8c16",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/jovyan/work/src/csv2influxdb.py:106: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_numeric without passing `errors` and catch exceptions explicitly instead\n",
      "  df[c] = pd.to_numeric(df[c], errors=\"ignore\")\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                  timestamp  Vibration Velocity  sensor_01  \\\n",
      "0 2025-03-30 00:00:00+00:00            2.465394   47.09201   \n",
      "1 2025-03-30 00:01:00+00:00            2.465394   47.09201   \n",
      "2 2025-03-30 00:02:00+00:00            2.444734   47.35243   \n",
      "3 2025-03-30 00:03:00+00:00            2.460474   47.09201   \n",
      "4 2025-03-30 00:04:00+00:00            2.445718   47.13541   \n",
      "\n",
      "   Bearing Temperature  sensor_03  sensor_04  sensor_05  Discharge Pressure  \\\n",
      "0              53.2118  46.310760   634.3750   76.45975            13.41146   \n",
      "1              53.2118  46.310760   634.3750   76.45975            13.41146   \n",
      "2              53.2118  46.397570   638.8889   73.54598            13.32465   \n",
      "3              53.1684  46.397568   628.1250   76.98898            13.31742   \n",
      "4              53.2118  46.397568   636.4583   76.58897            13.35359   \n",
      "\n",
      "   sensor_07  \n",
      "0   16.13136  \n",
      "1   16.13136  \n",
      "2   16.03733  \n",
      "3   16.24711  \n",
      "4   16.21094  \n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/jovyan/work/src/csv2influxdb.py:106: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_numeric without passing `errors` and catch exceptions explicitly instead\n",
      "  df[c] = pd.to_numeric(df[c], errors=\"ignore\")\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                  timestamp  LV ActivePower  Wind Speed  \\\n",
      "0 2024-12-30 00:00:00+00:00      380.047791    5.311336   \n",
      "1 2024-12-30 00:10:00+00:00      453.769196    5.672167   \n",
      "2 2024-12-30 00:20:00+00:00      306.376587    5.216037   \n",
      "3 2024-12-30 00:30:00+00:00      419.645905    5.659674   \n",
      "4 2024-12-30 00:40:00+00:00      380.650696    5.577941   \n",
      "\n",
      "   Theoretical_Power_Curve  Wind Direction  \n",
      "0               416.328908      259.994904  \n",
      "1               519.917511      268.641113  \n",
      "2               390.900016      272.564789  \n",
      "3               516.127569      271.258087  \n",
      "4               491.702972      265.674286  \n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'ACME Limited.ACME Plant.PUMP-001': 'imported',\n",
       " 'ACME Limited.ACME Plant.PUMP-002': 'missing',\n",
       " 'ACME Limited.ACME Plant.WIND-TURB-01': 'imported'}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from csv2influxdb import EquipmentCsvInfluxImporter\n",
    "data_importer = EquipmentCsvInfluxImporter(\"http://influxdb:8086\", \"MyInitialAdminToken0==\", \"iiot\", \"measures\", \"../data\")\n",
    "data_importer.import_all(equipments['EQUIPMENT'].values)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "972295c5-03cb-4ee1-8961-f7f40fa1410d",
   "metadata": {},
   "source": [
    "## Sync the value among the 2 DBs\n",
    "* foreach mesure get last valu and write to neo4j\n",
    "* you can schedule this sync using AirfLow or Kubernetes sheduler see [Hands-On Industrial Internet of Things: Build robust industrial IoT infrastructure by using the cloud and artificial intelligence 2nd ed. Edition](https://a.co/d/0dfb4HKH)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "8e736c5e-6089-4226-be21-c35d576424dc",
   "metadata": {},
   "outputs": [],
   "source": [
    "from syncdbs import SyncDBs\n",
    "sync = SyncDBs(data_importer.client, graph_importer.driver)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "e6260818-e7e5-4e8d-8814-9c31955ba2c2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ACME Limited.ACME Plant.PUMP-001 Bearing Temperature updated to value= 56.032990000000005\n",
      "ACME Limited.ACME Plant.PUMP-001 Discharge Pressure updated to value= 22.25116\n",
      "ACME Limited.ACME Plant.PUMP-001 Vibration Velocity updated to value= 2.549016\n",
      "Empy result ACME Limited.ACME Plant.PUMP-002 Motor Current []\n",
      "Empy result ACME Limited.ACME Plant.PUMP-002 Suction Pressure []\n",
      "Empy result ACME Limited.ACME Plant.PUMP-002 Vibration Velocity []\n",
      "ACME Limited.ACME Plant.WIND-TURB-01 LV ActivePower updated to value= 3618.73291015625\n",
      "ACME Limited.ACME Plant.WIND-TURB-01 Wind Direction updated to value= 359.997589111328\n",
      "ACME Limited.ACME Plant.WIND-TURB-01 Wind Speed updated to value= 25.2060108184814\n"
     ]
    }
   ],
   "source": [
    "sync.sync()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "611eab28-fbb7-439b-a25f-727a07c388d9",
   "metadata": {},
   "outputs": [],
   "source": [
    "data_importer.close()\n",
    "graph_importer.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "42b0cdec-201b-422c-ae67-486af0ebef74",
   "metadata": {},
   "source": [
    "# Graph Rag"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "063e7cb7",
   "metadata": {
    "vscode": {
     "languageId": "plaintext"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "MATCH (c:Company)-[:HAS_INSTALLATION]->(i:Installation)-[:HAS_EQUIPMENT]->(e:Equipment {id: 'PUMP-001'})-[:EXPERIENCED_FAILURE]->(f:FailureEvent)\n",
      "RETURN f.id, f.impact, f.down_time_hrs, f.mode, f.mechanism\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'f.id': 'FAIL-P001-01', 'f.impact': 'Critical', 'f.down_time_hrs': 14.0, 'f.mode': 'External leakage', 'f.mechanism': 'Wear'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'query': 'Which events occurred at Equipment PUMP-001?',\n",
       " 'result': ' The event recorded at Equipment PUMP-001 was a Critical external leakage due to wear, which lasted for 14 hours.'}"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from graphrag_app import OllamaGraphRAG\n",
    "app = OllamaGraphRAG(\"neo4j://neo4j\",\"neo4j\",\"password\")\n",
    "app.chat_with_rag(\"Which events occurred at Equipment PUMP-001?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "2f814ed7-aa63-42f5-bf32-61396a348e62",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "MATCH (c:Company)-[:HAS_INSTALLATION]->(i:Installation)-[:HAS_EQUIPMENT]->(e:Equipment)\n",
      "WHERE e.id = 'WIND-TURB-01'\n",
      "OPTIONAL MATCH (e)-[:HAS_MEASUREMENT]->(m:Measurement)\n",
      "WHERE m.name = 'Wind Speed'\n",
      "RETURN m.value\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'m.value': 25.2060108184814}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'query': 'What is the Wind Speed of Equipment WIND-TURB-01?',\n",
       " 'result': ' The wind speed of Equipment WIND-TURB-01 is 25.2060108184814 [m/s].'}"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "app.chat_with_rag(\"What is the Wind Speed of Equipment WIND-TURB-01?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "5d5a51a7-e536-4dc1-90f9-d3c6284aafca",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "MATCH (c:Company)-[:HAS_INSTALLATION]->(i:Installation {name: 'ACME Plant'})-[:HAS_EQUIPMENT]->(e:Equipment)\n",
      "WHERE e.criticality = 'High'\n",
      "RETURN e\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'e': {'criticality': 'High', 'model': 'X-Flow 500', 'operating_mode': 'Continuous', 'id': 'PUMP-001', 'manufacturer': 'FluidDrive Corp'}}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'query': \"Can you get me the High critical equipment of Installation 'ACME Plant'?\",\n",
       " 'result': \" The High critical equipment of Installation 'ACME Plant' is the X-Flow 500, which is manufactured by FluidDrive Corp and operates in Continuous mode.\"}"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "app.chat_with_rag(\"Can you get me the High critical equipment of Installation 'ACME Plant'?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f9103c5c-eefd-4ef6-989e-b322ac666166",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
