{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "4378fdbf",
   "metadata": {
    "vscode": {
     "languageId": "plaintext"
    }
   },
   "outputs": [],
   "source": [
    "import sys\n",
    "import os\n",
    "\n",
    "# Aggiunge la cartella 'src' relativa alla posizione dello script\n",
    "sys.path.append(os.path.abspath(\"src\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "8ec4e5f3",
   "metadata": {
    "vscode": {
     "languageId": "plaintext"
    }
   },
   "outputs": [],
   "source": [
    "from iso2neo4j import PlantDataImporter\n",
    "importer = PlantDataImporter(\"neo4j://neo4j\",\"neo4j\",\"password\")\n",
    "importer.clean_all_data()\n",
    "importer.import_plant_data(\"../data/acme-plant.json\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "063e7cb7",
   "metadata": {
    "vscode": {
     "languageId": "plaintext"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "MATCH (c:Company)-[:HAS_INSTALLATION]->(i:Installation)<-[:HAS_EQUIPMENT]- (e:Equipment {id: 'PUMP-001'})-[:EXPERIENCED_FAILURE]->(f:FailureEvent)\n",
      "RETURN f\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'f': {'mode': 'External leakage', 'impact': 'Critical', 'id': 'FAIL-P001-01', 'mechanism': 'Wear', 'down_time_hrs': 14.0}}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "' A critical event of external leakage occurred at Equipment PUMP-001, with a duration of 14 hours. The mode of the event is wear.'"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from graphrag_app import OllamaGraphRAG\n",
    "app = OllamaGraphRAG(\"neo4j://neo4j\",\"neo4j\",\"password\")\n",
    "app.chat_with_rag(\"Extract events occurred at Equipment PUMP-001\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "2f814ed7-aa63-42f5-bf32-61396a348e62",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "MATCH (equipment:Equipment {id: 'PUMP-001'})-[:HAS_MEASUREMENT]->(measurement)\n",
      "WHERE measurement.name = 'Vibration Velocity'\n",
      "RETURN measurement.value\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'measurement.value': 4.2}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "' The vibration velocity of Equipment PUMP-001 is 4.2.'"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "app.chat_with_rag(\"What is the Vibration Velocity of Equipment PUMP-001?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "5d5a51a7-e536-4dc1-90f9-d3c6284aafca",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "MATCH (c:Company)-[:HAS_INSTALLATION]->(i:Installation {name: 'ACME Plant'})-[:HAS_EQUIPMENT]->(e:Equipment)\n",
      "WHERE e.criticality = 'High'\n",
      "RETURN e\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\" I'm unable to provide the high critical equipment for the 'ACME Plant' as the provided information doesn't contain that data.\""
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "app.chat_with_rag(\"Can you get me the High critical equipment of Installation 'ACME Plant'?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f9103c5c-eefd-4ef6-989e-b322ac666166",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
